blog/2016/10/20/用org-mode写论文的一些tips/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>用Org-mode写论文的一些tips - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <link rel="stylesheet" href="https://lujun9972.github.io/emacs-document/media/css/main.css" type="text/css"/>
  <link rel="stylesheet" href="https://lujun9972.github.io/emacs-document/media/css/comment.css" type="text/css"/>
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="https://lujun9972.github.io/emacs-document/">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;集思广益</p>
    <nav class="site-nav">
      <div class="menu-icon">
        <svg viewBox="0 0 18 15">
          <path d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z" fill="#ffff00"/>
          <path d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z" fill="#ffff00"/>
          <path d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z" fill="#ffff00"/>
        </svg>
      </div>
      <ul class="trigger">
        <li><a href="https://lujun9972.github.io/emacs-document/years/">Years</a></li>
        <li><a href="https://lujun9972.github.io/emacs-document/authors/">Authors</a></li>
        <li><a href="https://lujun9972.github.io/emacs-document/tags/">Tags</a></li>
        <li><a href="https://lujun9972.github.io/emacs-document/about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document">Github</a></li>
        <li><a href="https://lujun9972.github.io/emacs-document/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">用Org-mode写论文的一些tips</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf7f9b18">1. Introduction</a></li>
<li><a href="#orgd28f7ed">2. Set up a Template</a></li>
<li><a href="#org2e70566">3. Enable Fast, LaTeX-friendly Spellcheck</a></li>
<li><a href="#org5e0a878">4. Enable CDLaTeX</a></li>
<li><a href="#orgca7edf4">5. Automatically Count Words</a></li>
<li><a href="#orgc3cb6a7">6. Distraction-free Writing: Enable writeroom-mode</a></li>
<li><a href="#orgc38b0d4">7. Enable RefTex for Fast Insertion of Citations</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf7f9b18" class="outline-2">
<h2 id="orgf7f9b18"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
许多人都将org-mode作为制定计划的工具来用, 不过我也同时觉得它很适合用来写论文,你甚至可以通过 <code>\(\rm\LaTeX{}\)</code> 导出为pdf文件.
如果你没有有特别严格的格式要求,org可以加快你的写作速度,而且提供了许多超棒的功能供你使用.
下面是一些tips希望可以帮到你们.
</p>
</div>
</div>

<div id="outline-container-orgd28f7ed" class="outline-2">
<h2 id="orgd28f7ed"><span class="section-number-2">2</span> Set up a Template</h2>
<div class="outline-text-2" id="text-2">
<p>
如果你在编写人文类的论文,你可以在org文件的头部添加一些内容来格式化你的论文格式.
确定好你的论文格式并设置好相应的模板能够极大的简化你的工作量(It makes things much easier if you figure out what you standardly need in a paper and set up a template to include them each time).
I just have a TextExpander snippet set up for this. 下面是一份例子.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #2aa1ae; background-color: #292e34;"># Set the article class</span>
<span style="color: #9f8766;">#+LaTeX_CLASS: article</span>
<span style="color: #9f8766;">#+LaTeX_CLASS_OPTIONS: [12pt]</span>

<span style="color: #2aa1ae; background-color: #292e34;"># No need for a table of contents, unless your paper is quite long.</span>
<span style="color: #9f8766;">#+OPTIONS: toc:nil</span>

<span style="color: #2aa1ae; background-color: #292e34;"># Use fancy looking fonts. If you don't have MinionPro installed,</span>
<span style="color: #2aa1ae; background-color: #292e34;"># a good alternative is the Palatino-style pxfonts.</span>
<span style="color: #2aa1ae; background-color: #292e34;"># See: <a href="http://www.tug.dk/FontCatalogue/pxfonts/">http://www.tug.dk/FontCatalogue/pxfonts/</a></span>
<span style="color: #9f8766;">#+LATEX_HEADER: \usepackage[mathlf]{MinionPro}</span>
<span style="color: #9f8766;">#+LATEX_HEADER: \usepackage[scaled=.875]{inconsolata}</span>

<span style="color: #2aa1ae; background-color: #292e34;"># Set the spacing to double, as required in most papers.</span>
<span style="color: #9f8766;">#+LATEX_HEADER: \usepackage{setspace}</span>
<span style="color: #9f8766;">#+LATEX_HEADER: \doublespacing</span>

<span style="color: #2aa1ae; background-color: #292e34;"># Fix the margins</span>
<span style="color: #9f8766;">#+LATEX_HEADER: \usepackage[margin=1in]{geometry}</span>

<span style="color: #2aa1ae; background-color: #292e34;"># This line makes lists work better:</span>
<span style="color: #2aa1ae; background-color: #292e34;"># It eliminates whitespace before/within a list and pushes it tt the left margin</span>
<span style="color: #9f8766;">#+LATEX_HEADER: \usepackage{enumitem}</span>
<span style="color: #9f8766;">#+LATEX_HEADER: \setlist[enumerate,itemize]{noitemsep,nolistsep,leftmargin=*}</span>

<span style="color: #2aa1ae; background-color: #292e34;"># I always include this for my bibliographies</span>
<span style="color: #9f8766;">#+LATEX_HEADER: \usepackage[notes,isbn=false,backend=biber]{biblatex-chicago}</span>
<span style="color: #9f8766;">#+LATEX_HEADER: \addbibresource{/Users/clarkdonley/Files/Academic/Bibliography/main.bib}</span>

<span style="color: #9f8766;">#+TITLE:</span> <span style="color: #bc6ec5; font-size: 140%; font-weight: bold; text-decoration: underline;">An Example Title</span>
<span style="color: #9f8766;">#+AUTHOR:</span> <span style="color: #afeeee;">Clark Donley</span>
<span style="color: #9f8766;">#+DATE:</span> <span style="color: #afeeee;">October 26, 2014</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e70566" class="outline-2">
<h2 id="org2e70566"><span class="section-number-2">3</span> Enable Fast, LaTeX-friendly Spellcheck</h2>
<div class="outline-text-2" id="text-3">
<p>
当你进入org-mode时并不会自动运行拼写检查功能, 拼写检查的功能对写论文很明显是一大助力.
要实现写论文时启动拼写检查,需要经过一下三个步骤. 当然那前提是你已经安装了 <a href="http://www-sop.inria.fr/members/Manuel.Serrano/flyspell/flyspell.html">flyspell</a>.
</p>

<p>
以下几个步骤需要修改你的 <code>.emacs</code> 或者 <code>Preferences.el</code> 文件.
</p>

<ol class="org-ol">
<li>将Flyspell 挂载到 Org-mode 的hook中.</li>
<li>关掉掉Flyspell messages. 
Flyspell在启动时,若你允许在status bar上现实 spell-checking的过程,那会造成一些明显的延时,因此若你不希望每次打开org文件都有一些延时的话,你需要关掉这些message.</li>
<li>在拼写检查时忽略对 <code>\(\rm\LaTeX{}\)</code> 命令的检查. 我随处都可能会用到 <code>\(\rm\LaTeX{}\)</code> 里的命令,如果不忽略掉这些检查,你会发现到处都有拼写错误的提示,显得很乱.</li>
</ol>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">1. hook flyspell into org-mode</span>
<span style="color: #4f97d7;">(</span>add-hook 'org-mode-hook 'flyspell-mode<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>add-hook 'org-mode-hook 'flyspell-buffer<span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">2. ignore message flags</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> flyspell-issue-message-flag nil<span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">3. ignore tex commands</span>
<span style="color: #4f97d7;">(</span>add-hook 'org-mode-hook <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">lambda</span> <span style="color: #2d9574;">()</span> <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> ispell-parser 'tex<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">flyspell-ignore-tex</span> <span style="color: #bc6ec5;">()</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">interactive</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>set <span style="color: #2d9574;">(</span>make-variable-buffer-local 'ispell-parser<span style="color: #2d9574;">)</span> 'tex<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>add-hook 'org-mode-hook 'flyspell-ignore-tex<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e0a878" class="outline-2">
<h2 id="org5e0a878"><span class="section-number-2">4</span> Enable CDLaTeX</h2>
<div class="outline-text-2" id="text-4">
<p>
CDLaTeX是一款经常与LaTex major mode在一起使用的minor mode. 他能够提高插入环境变量以及数学模板的速率.
<a href="https://www.gnu.org/software/emacs/manual/html_node/org/CDLaTeX-mode.html">在Org manual中告诉了你一个很简单的启动该minor mode的方法</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>add-hook 'org-mode-hook 'turn-on-org-cdlatex<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgca7edf4" class="outline-2">
<h2 id="orgca7edf4"><span class="section-number-2">5</span> Automatically Count Words</h2>
<div class="outline-text-2" id="text-5">
<p>
我认为恁能在写论文时能实时知道写了多少字应该很不错. 要实现这一点非常简单.
安装好<a href="https://github.com/bnbeckwith/wc-mode">wc-mode</a> 后,再将下列放到你的 <code>.emacs</code> 或 <code>Preferences.el</code> 中就行了.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>add-hook 'org-mode-hook 'wc-mode<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3cb6a7" class="outline-2">
<h2 id="orgc3cb6a7"><span class="section-number-2">6</span> Distraction-free Writing: Enable writeroom-mode</h2>
<div class="outline-text-2" id="text-6">
<p>
这并不是org所特有的功能, 当你写作时可以开启 <a href="https://github.com/joostkremers/writeroom-mode">writeroom-mode</a> 来屏蔽调所有的干扰.
<code>Writeroom-mode</code> 会全屏居中显示正在写得内容,而没有任何其他的东西.
</p>
</div>
</div>
